#include <stdio.h>

int main()
{
	int x=13542;
	int y=10000;
	int d;
	//要想得到最高位的数字，就要除以这个数的位数对应的几位的数
	//例如：要想得到189的1；就要用189/100→1（其中189三位数对应三位数的100） 
	//13542/10000→1     1后面几个0，数的小数点向前进几位 
	//13542%10000→3542
	//10000/10→1000
	//3542/1000→3
	//3542%1000→542
	//1000/10→100
	//542/100→5
	//542%100→42
	//100/10→10
	//42/10→4
	//42%10→2
	//10/10→1
	//2/1→2
	//2%1→0
	//1/10→0
	do{      //x=13542
		d=x/y;
		printf("%d",d);
		if(y>9){     //末尾的2后面没有空格 
		printf(" ");
		}
		x%=y;
		y/=10;
	}while(y>0);
	printf("\n");

	return 0;
}

