#include <stdio.h>
#include <math.h>
//将一个数正序拆开 
int main()
{
	int x;
	scanf("%d",&x);
	//x=18962;
	/*18962/10000→1
	  18962%10000→8962
	  10000/10→1000
	  8962/1000→8
	  8962%1000→962
	  1000/10→100
	  962/100→9
	  962%100→62
	  100/10→10
	  62/10→6
	  62%10→2
	  10/10→1
	  2/1→2
	  2%1→0
	  1/10→0*/
	/*首先要根据数的位数计算出其对应的数，如18962对应10000，五位数对应4个0，10的一次方有一个0，
	所以五位数对应10的四次方，所以N位数对应的数为10的N-1次方*/ 
	//x=18962
	int cnt=0;
	int z;
	z=x;
	while(z>0){
		z/=10;
		cnt++;
	}//cnt=5 x=0
	int t=pow(10,cnt-1);//t=10000
	int d;
	do{
		//拆开： 
		 d=x/t;//18962/10000→1      8962/1000→8         962/100→9
		 printf("%d",d);
		 x%=t;//18962%10000→8962    8962%1000→962       962%100→62
		 if(t>9){       //消除末尾的那个空格 
		 	printf(" ");
		 }
		 t/=10;//t=1000               1000/10→100        100/10→10
	}while(t>0);

	return 0;
}
